a = int(input('Введите число вашего рождения'))
b = int(input('Введите номер месяца вашего рождения'))
c = int(input('Введите год вашего рождения'))

print('Вы ввели дату:', a, b, c)

d = int(input('Введите нынешний год'))
f = int(input('Введите номер нынешнего месяца'))
g = int(input('Введите сегодняшнее число'))

vozrast = d - c  # Алгоритм вычисления возраста человека
if f < b:
    print('Ваш возраст в годах:', vozrast - 1, )
elif f == b and a < g:
    print('Ваш возраст в годах:', vozrast - 1, )
elif f == b and a == g:
    print('Ваш возраст в годах:', vozrast, 'С Днём Рождения!')
else:
    print('Ваш возраст в годах:', vozrast)

if b == 3 and a >= 21:  # Овен
    print('Ваш знак зодиака: Овен')
elif b == 4 and a <= 20:
    print('Ваш знак зодиака: Овен')

if b == 4 and a >= 21:  # Телец
    print('Ваш знак зодиака: Телец')
elif b == 5 and a <= 20:
    print('Ваш знак зодиака: Телец')

if b == 5 and a >= 21:  # Близнецы
    print('Ваш знак зодиака: Близнецы')
elif b == 6 and a <= 21:
    print('Ваш знак зодиака: Близнецы')

if b == 6 and a >= 22: # Рак
    print('Ваш знак зодиака: Рак')
elif b == 7 and a <= 22:
    print('Ваш знак зодиака: Рак')

if b == 7 and a >= 23: # Лев
    print('Ваш знак зодиака: Лев')
elif b == 8 and a <= 23:
    print('Ваш знак зодиака: Лев')

if b == 8 and a >= 24: # Дева
    print('Ваш знак зодиака: Дева')
elif b == 9 and a <= 22:
    print('Ваш знак зодиака: Дева')

if b == 9 and a >= 23: # Весы
    print('Ваш знак зодиака: Весы')
elif b == 10 and a <= 23:
    print('Ваш знак зодиака: Весы')

if b == 10 and a >= 24: # Скорпион
    print('Ваш знак зодиака: Скорпион')
elif b == 11 and a <= 22:
    print('Ваш знак зодиака: Скорпион')

if b == 11 and a >= 23: # Стрелец
    print('Ваш знак зодиака: Стрелец')
elif b == 12 and a <= 21:
    print('Ваш знак зодиака: Стрелец')

if b == 12 and a >= 22: # Козерог
    print('Ваш знак зодиака: Козерог')
elif b == 1 and a <= 19:
    print('Ваш знак зодиака: Козерог')

if b == 1 and a >= 20: # Водолей
    print('Ваш знак зодиака: Водолей')
elif b == 2 and a <= 18:
    print('Ваш знак зодиака: Водолей')

if b == 2 and a >= 19: # Рыбы
    print('Ваш знак зодиака: Рыбы')
elif b == 3 and a <= 20:
    print('Ваш знак зодиака: Рыбы')






